---
type: IFamilyLoadOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# IFamilyLoadOptions

`Autodesk.Revit.DB.IFamilyLoadOptions` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | OnFamilyFound | — | `bool OnFamilyFound ( bool familyInUse , out bool overwriteParameterValues )` |
| Method | OnSharedFamilyFound | — | `bool OnSharedFamilyFound ( Family sharedFamily , bool familyInUse , out FamilySource source , out bool overwriteParameterValues )` |